PANDAS
SERIES

In [ ]:
import numpy as np
import pandas as pd

Convert list, numpy array or dictionary to  a series

In [ ]:
l= ['a','b','c','d','e']
a= [1,2,3,4,5]
ar=np.array([1,2,3,4,5])
d={'a':1, 'b':2,'c':3,'d':4,'e':5}

In [ ]:
pd.Series(a)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
pd.Series(a, index=l)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
pd.Series(ar)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
pd.Series(d)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
s1=pd.Series([1,2,4,6], index=['Rose', 'Lotus', 'Lilly','Daisy'])
s1

Rose     1
Lotus    2
Lilly    4
Daisy    6
dtype: int64

In [ ]:
s2=pd.Series([1,2,5,6], index=['Sunflower', 'Lotus', 'Cherry blossom','Daisy'])
s2

Sunflower         1
Lotus             2
Cherry blossom    5
Daisy             6
dtype: int64

In [ ]:
s1+s2

Cherry blossom     NaN
Daisy             12.0
Lilly              NaN
Lotus              4.0
Rose               NaN
Sunflower          NaN
dtype: float64

In [ ]:
from numpy.random import randn
np.random.seed(101)

In [ ]:
df=pd.DataFrame(randn(5,4), index='A B C D E'.split(), columns='P Q R S'.split())

In [ ]:
df

          P         Q         R         S
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[['R','S']]

          R         S
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

In [ ]:
df['R']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: R, dtype: float64

CREATING A NEW COLUMN

In [ ]:
df['T']=df['R']+df['S']
df

          P         Q         R         S         T
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

DELETE COLUMN

In [ ]:
df.drop('T')

KeyError: ignored

In [ ]:
df.drop('T', axis=1)

          P         Q         R         S
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df

          P         Q         R         S         T
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [ ]:
df.drop('T', axis=1, inplace=True)

In [ ]:
df

          P         Q         R         S
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.loc['A']

P    2.706850
Q    0.628133
R    0.907969
S    0.503826
Name: A, dtype: float64

In [ ]:
df.iloc[0]

P    2.706850
Q    0.628133
R    0.907969
S    0.503826
Name: A, dtype: float64

In [ ]:
df.loc['A','P']

2.706849839399938

In [ ]:
df.loc[['A','B'],['P','Q']]

          P         Q
A  2.706850  0.628133
B  0.651118 -0.319318

CONDITIONAL SELECTION

In [ ]:
df

          P         Q         R         S
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df>0]

          P         Q         R         S
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df['P']>0]

          P         Q         R         S
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df['P']>0]['R']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: R, dtype: float64

In [ ]:
df[(df['P']>0) & (df['Q']> 1)]

          P         Q         R         S
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[(df['P']>0) | (df['Q']> 1)]

          P         Q         R         S
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

OPERATIONS

In [ ]:
df=pd.DataFrame({'C1':[1,2,3,4], 'C2':[444,555,666,777],'C3':['abc','def','ghi','jkl']})
df

   C1   C2   C3
0   1  444  abc
1   2  555  def
2   3  666  ghi
3   4  777  jkl

In [ ]:
df['C2'].unique()

array([444, 555, 666, 777])

In [ ]:
df['C2'].nunique()

4

In [ ]:
df['C2'].value_counts()

444    1
555    1
666    1
777    1
Name: C2, dtype: int64

In [ ]:
a=df[(df['C1']>2) & (df['C2']==666)]
a

   C1   C2   C3
2   3  666  ghi

In [ ]:
df[df['C1']>2]

   C1   C2   C3
2   3  666  ghi
3   4  777  jkl

In [ ]:
df[df['C2']==666]

   C1   C2   C3
2   3  666  ghi

FUNCTIONS

In [ ]:
def fun(x):
  return x*2
df['C1'].apply(fun)

0    2
1    4
2    6
3    8
Name: C1, dtype: int64

In [ ]:
df['C3'].apply(len)

0    3
1    3
2    3
3    3
Name: C3, dtype: int64

In [ ]:
df['C1'].sum()

10

In [ ]:
del df['C2']

In [ ]:
df

   C1   C3
0   1  abc
1   2  def
2   3  ghi
3   4  jkl

In [ ]:
df.columns

Index(['C1', 'C3'], dtype='object')

In [ ]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
df.sort_values(by='C1')

   C1   C3
0   1  abc
1   2  def
2   3  ghi
3   4  jkl

In [ ]:

df.isnull()

      C1     C3
0  False  False
1  False  False
2  False  False
3  False  False

DATA INPUT AND OUTPUT